<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [168]:
# adição 

5 + 7

12

In [169]:
# subtração 

21 - 9

12

In [170]:
# multiplicação 

3 * 9

27

In [171]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [172]:
a = 39

In [173]:
b = a + 1

In [174]:
b

40

In [175]:
b * 2

80

**Aquecimento operadores matemáticos**

In [176]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [177]:
resultado = arroz + leite + carne + sabonete + alvejante

In [178]:
resultado

81.44

In [179]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [180]:
# potenciação 

2 ** 2

4

In [181]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [182]:
# igualdade

700 == 90

False

In [183]:
100 == 100

True

In [184]:
80.0 == 80

True

In [185]:
# desigualdade 

3 != 7

True

In [186]:
3 != 3

False

In [187]:
# maior que 

500 > 90

True

In [188]:
90 > 500

False

In [189]:
# menor que 

500 < 90

False

In [190]:
90 < 500

True

In [191]:
# maior ou igual 

8 >= 8

True

In [192]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [193]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [194]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [195]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [196]:
lista = [3, 8, 44, 100]

In [197]:
for x in lista:
    print(x)

3
8
44
100

In [198]:
lista2 = [3, 8, 44, 100]

In [199]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [200]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [201]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [202]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [203]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [204]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [205]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [206]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [207]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [208]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [209]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [210]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [211]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [212]:
print_text()

Aqui é um texto qaulquer

In [213]:
def print_isto(x):
    print(x)

In [214]:
print_isto(7958)

7958

In [215]:
def potencia(x):
    p = x ** 2
    return p

In [216]:
potencia(4)

16

In [217]:
def sub(x):
    r = x + 4
    return r

In [218]:
sub (1000)

1004

In [219]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [220]:
potencia_n(5)

25

In [221]:
potencia_n(5, 3)

125

# MÓDULO 2

### IMPORTS

In [222]:
import pandas as pd
import numpy as np

## 2.1. Dataframes

In [223]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [224]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [225]:
type(series)

pandas.core.series.Series

In [226]:
datas = pd.date_range('20220101', periods = 6 )

In [227]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [228]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [229]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [230]:
df

                   A         B         C         D
2022-01-01 -0.364742 -0.965460  0.967211  1.367736
2022-01-02  0.129466  0.398523  0.825035 -0.032516
2022-01-03 -1.428146  0.048625  0.538318 -1.343516
2022-01-04 -0.506792  1.448722 -2.359350  0.163689
2022-01-05 -0.573279  0.649137  1.894245 -0.781912
2022-01-06  1.957465  1.390969 -0.221324 -0.420001

In [231]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [232]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [233]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [234]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [235]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [236]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [237]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [238]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [239]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [240]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [241]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [242]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [243]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [244]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [245]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [246]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [247]:
dfg

            A      B         C         D
0  verdadeiro     um -0.127952 -0.121413
1       falso     um  0.976458  1.768174
2  verdadeiro   dois  0.940065  0.582561
3       falso   tres -1.244947 -1.712147
4  verdadeiro   dois -1.308158 -1.809697
5       falso   dois -1.615104  1.132487
6  verdadeiro    um   0.292023  0.488565
7       falso   tres -0.184746  1.264423

#### Soma dos valores das colunas baseada na coluna A

In [248]:
dfg.groupby(['A']).sum()

                   C         D
A
falso      -2.068339  2.452938
verdadeiro -0.204022 -0.859984

#### Média dos valores das colunas baseada na coluna A

In [249]:
dfg.groupby(['A']).mean()

                   C         D
A
falso      -0.517085  0.613235
verdadeiro -0.051005 -0.214996

#### Soma dos valores das colunas baseada na coluna B

In [250]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -1.615104  1.132487
dois  -0.368093 -1.227136
tres  -1.429693 -0.447724
um     0.848505  1.646761
um     0.292023  0.488565

#### Média dos valores das colunas baseada na coluna B

In [251]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -1.615104  1.132487
dois  -0.184046 -0.613568
tres  -0.714846 -0.223862
um     0.424253  0.823381
um     0.292023  0.488565

#### Soma dos valores das colunas baseada nas colunas A e B

In [252]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -1.615104  1.132487
           tres  -1.429693 -0.447724
           um     0.976458  1.768174
verdadeiro dois  -0.368093 -1.227136
           um    -0.127952 -0.121413
           um     0.292023  0.488565

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [253]:
lista = [ 32, 96, 11, 27]

In [254]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [255]:
lista [-1]

27

### Indexação múltlipla

In [256]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [257]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [258]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [259]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados

In [260]:
datas = pd.date_range('20220101', periods= 6 )

df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [261]:
df

               var_A     var_B     var_C     var_D
2022-01-01 -0.353595 -1.525632  2.015866 -0.696812
2022-01-02 -0.707115 -0.873840  0.971495 -0.384661
2022-01-03  1.162702  0.403945  0.733008 -0.164952
2022-01-04 -1.162548 -1.674537 -1.015645 -0.394601
2022-01-05 -0.327809 -0.529225  0.148101  0.774116
2022-01-06  2.040410  0.152930  0.818258 -0.345705

In [262]:
dft = df.T

In [263]:
dft

       2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
var_A   -0.353595   -0.707115    1.162702   -1.162548   -0.327809    2.040410
var_B   -1.525632   -0.873840    0.403945   -1.674537   -0.529225    0.152930
var_C    2.015866    0.971495    0.733008   -1.015645    0.148101    0.818258
var_D   -0.696812   -0.384661   -0.164952   -0.394601    0.774116   -0.345705

In [264]:
df.shape

(6, 4)

### 2.5.1. Função pivot

In [265]:
data = pd.date_range('20220101', periods= 12 )

pessoa = ['George', 'Victor', 'Lucas']

In [266]:
data

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [267]:
nome = []

gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.randn()*100,2 ))
    
    nome

In [268]:
df = pd.DataFrame({'Data': data, 'Nome': nome, 'Gasto': gasto})

In [269]:
df

         Data    Nome   Gasto
0  2022-01-01  George   25.84
1  2022-01-02  Victor   85.65
2  2022-01-03  George  -15.11
3  2022-01-04   Lucas   82.33
4  2022-01-05  Victor -120.64
5  2022-01-06  George  167.49
6  2022-01-07  Victor   57.40
7  2022-01-08  George   46.00
8  2022-01-09   Lucas   -3.91
9  2022-01-10  George   -6.96
10 2022-01-11  George  -49.16
11 2022-01-12  George   69.37

In [270]:
pd.pivot(df, index= 'Data', columns= 'Nome', values= 'Gasto')

Nome        George  Lucas  Victor
Data
2022-01-01   25.84    NaN     NaN
2022-01-02     NaN    NaN   85.65
2022-01-03  -15.11    NaN     NaN
2022-01-04     NaN  82.33     NaN
2022-01-05     NaN    NaN -120.64
2022-01-06  167.49    NaN     NaN
2022-01-07     NaN    NaN   57.40
2022-01-08   46.00    NaN     NaN
2022-01-09     NaN  -3.91     NaN
2022-01-10   -6.96    NaN     NaN
2022-01-11  -49.16    NaN     NaN
2022-01-12   69.37    NaN     NaN

### 2.5.2. Função pivot table

In [271]:
carros = [7, 4, 3, 2, 8]

data = pd.date_range('20220101','20220101', periods= 5 )

vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

In [272]:
df = pd.DataFrame({'Vendas': carros, 'Data': data, 'Vendedor': vendedor})

In [273]:
df

   Vendas       Data Vendedor
0       7 2022-01-01   George
1       4 2022-01-01   Vagner
2       3 2022-01-01    Pedro
3       2 2022-01-01   Vagner
4       8 2022-01-01   George

A função **pivot table** não entrega valores de index duplicados

In [274]:
pd.pivot_table(df, index= 'Data', columns= 'Vendedor', values= 'Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2022-01-01      15      3       6

### 2.5.3. Stack e unstack de dados

coleta de dados da internet

In [275]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')

In [276]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [277]:
df.shape

(458, 9)

In [278]:
#Essa função empilha os dados em uma coluna

empilhamento = df.stack()

In [279]:
empilhamento.head(20)

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                 0.0
   Position                PG
   Age                   25.0
   Height                 6-2
   Weight               180.0
   College              Texas
   Salary           7730337.0
1  Name           Jae Crowder
   Team        Boston Celtics
   Number                99.0
   Position                SF
   Age                   25.0
   Height                 6-6
   Weight               235.0
   College          Marquette
   Salary           6796117.0
2  Name          John Holland
   Team        Boston Celtics
dtype: object

In [280]:
# Essa função reverte o processo de empilhamento

empilhamento.unstack()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

### 2.5.4. Função melt

In [281]:
df = pd.DataFrame({ 'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5,},
                    'C': {0: 2, 1: 4, 2: 6}})

In [282]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [283]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [284]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [285]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], var_name='nome da var', value_name='valor da var')

   A nome da var  valor da var
0  a           B             1
1  b           B             3
2  c           B             5
3  a           C             2
4  b           C             4
5  c           C             6

In [286]:
data = {
    'Localização' : ['cidadeA', 'cidadeB'], 
    'Temperatura' : ['prevista', 'atual'],
    'Set-2021':     [30, 32],
    'Out-2021':     [45, 43],
    'Nov-2021':     [24, 22]
}

print(data)

{'Localização': ['cidadeA', 'cidadeB'], 'Temperatura': ['prevista', 'atual'], 'Set-2021': [30, 32], 'Out-2021': [45, 43], 'Nov-2021': [24, 22]}

In [287]:
df = pd.DataFrame(data, columns = ['Localização', 'Temperatura', 'Set-2021', 'Out-2021', 'Nov-2021'])
df

  Localização Temperatura  Set-2021  Out-2021  Nov-2021
0     cidadeA    prevista        30        45        24
1     cidadeB       atual        32        43        22

In [288]:
df2 = pd.melt(df, id_vars=['Localização', 'Temperatura'], var_name='Data', value_name='Valor')

df2

  Localização Temperatura      Data  Valor
0     cidadeA    prevista  Set-2021     30
1     cidadeB       atual  Set-2021     32
2     cidadeA    prevista  Out-2021     45
3     cidadeB       atual  Out-2021     43
4     cidadeA    prevista  Nov-2021     24
5     cidadeB       atual  Nov-2021     22

## 2.6. Seleção de linhas e colunas

In [289]:
datas = pd.date_range('20210101', periods = 600)

df = pd.DataFrame(np.random.rand(600, 5), index = datas, columns = list('ABCDE'))

In [290]:
df.head(4)

                   A         B         C         D         E
2021-01-01  0.046667  0.594095  0.064589  0.738062  0.398274
2021-01-02  0.071947  0.796256  0.839928  0.471393  0.298414
2021-01-03  0.731517  0.779360  0.911050  0.365705  0.144078
2021-01-04  0.772460  0.925788  0.449741  0.094791  0.692518

In [291]:
df['D'].tail(5)

2022-08-19    0.542808
2022-08-20    0.520612
2022-08-21    0.268926
2022-08-22    0.732717
2022-08-23    0.816822
Freq: D, Name: D, dtype: float64

In [292]:
df[1 : 5]

                   A         B         C         D         E
2021-01-02  0.071947  0.796256  0.839928  0.471393  0.298414
2021-01-03  0.731517  0.779360  0.911050  0.365705  0.144078
2021-01-04  0.772460  0.925788  0.449741  0.094791  0.692518
2021-01-05  0.430439  0.756153  0.572376  0.060731  0.204682

In [293]:
df.loc[:, ['B', 'C', 'D']]

                   B         C         D
2021-01-01  0.594095  0.064589  0.738062
2021-01-02  0.796256  0.839928  0.471393
2021-01-03  0.779360  0.911050  0.365705
2021-01-04  0.925788  0.449741  0.094791
2021-01-05  0.756153  0.572376  0.060731
...              ...       ...       ...
2022-08-19  0.311259  0.562005  0.542808
2022-08-20  0.556420  0.037192  0.520612
2022-08-21  0.224290  0.677840  0.268926
2022-08-22  0.001397  0.695852  0.732717
2022-08-23  0.747748  0.932232  0.816822

[600 rows x 3 columns]

**Filtragem do intervalo entre as datas especificadas e das colunas A e C**

In [294]:
df.loc['20220101' : '20220323', ['A', 'C']].head(5)

                   A         C
2022-01-01  0.356507  0.701750
2022-01-02  0.628530  0.852656
2022-01-03  0.095935  0.861283
2022-01-04  0.282830  0.223149
2022-01-05  0.263469  0.792895

**Filtragem de todas as colunas da linha 1**

In [295]:
df.iloc[1]

A    0.071947
B    0.796256
C    0.839928
D    0.471393
E    0.298414
Name: 2021-01-02 00:00:00, dtype: float64

**Filtragem de um intervalo específico entre linhas e colunas (1º intervalo linhas, 2º colunas)**

In [296]:
df.iloc[1:4, 1: 6]

                   B         C         D         E
2021-01-02  0.796256  0.839928  0.471393  0.298414
2021-01-03  0.779360  0.911050  0.365705  0.144078
2021-01-04  0.925788  0.449741  0.094791  0.692518

**Filtragem de linhas e colunas escolhidas**

In [297]:
df.iloc[[7, 4, 8], [0, 3]]

                   A         D
2021-01-08  0.514049  0.505350
2021-01-05  0.430439  0.060731
2021-01-09  0.740976  0.896994

**Filtros booleanos**

In [298]:
df[df.A>0]

                   A         B         C         D         E
2021-01-01  0.046667  0.594095  0.064589  0.738062  0.398274
2021-01-02  0.071947  0.796256  0.839928  0.471393  0.298414
2021-01-03  0.731517  0.779360  0.911050  0.365705  0.144078
2021-01-04  0.772460  0.925788  0.449741  0.094791  0.692518
2021-01-05  0.430439  0.756153  0.572376  0.060731  0.204682
...              ...       ...       ...       ...       ...
2022-08-19  0.968469  0.311259  0.562005  0.542808  0.244064
2022-08-20  0.386239  0.556420  0.037192  0.520612  0.134407
2022-08-21  0.600563  0.224290  0.677840  0.268926  0.314033
2022-08-22  0.120529  0.001397  0.695852  0.732717  0.544513
2022-08-23  0.067690  0.747748  0.932232  0.816822  0.311348

[600 rows x 5 columns]

In [299]:
df[df > 0]

                   A         B         C         D         E
2021-01-01  0.046667  0.594095  0.064589  0.738062  0.398274
2021-01-02  0.071947  0.796256  0.839928  0.471393  0.298414
2021-01-03  0.731517  0.779360  0.911050  0.365705  0.144078
2021-01-04  0.772460  0.925788  0.449741  0.094791  0.692518
2021-01-05  0.430439  0.756153  0.572376  0.060731  0.204682
...              ...       ...       ...       ...       ...
2022-08-19  0.968469  0.311259  0.562005  0.542808  0.244064
2022-08-20  0.386239  0.556420  0.037192  0.520612  0.134407
2022-08-21  0.600563  0.224290  0.677840  0.268926  0.314033
2022-08-22  0.120529  0.001397  0.695852  0.732717  0.544513
2022-08-23  0.067690  0.747748  0.932232  0.816822  0.311348

[600 rows x 5 columns]

## 2.7. Limpeza dos dados

### 2.7.1 Sumarização dos dados

In [300]:
datas = pd.date_range('20180101', periods = 6)

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [301]:
df2 = pd.DataFrame({'A': pd.Timestamp('20130102'),
                    'B': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'C': np.array([3] * 4, dtype = 'int32'),
                    'D': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'
    
})

In [302]:
df

               var_A     var_B     var_C     var_D
2018-01-01 -1.066732  0.520149  1.566308  0.224808
2018-01-02  1.367745 -1.796581  1.248066 -0.788747
2018-01-03 -0.740111  0.944649 -0.024702  1.166624
2018-01-04  0.689837 -1.045093  0.099687  0.659116
2018-01-05 -0.513988  0.935222  1.262412 -1.374424
2018-01-06  1.524611 -0.409084  0.293908 -1.333953

In [303]:
df.shape

(6, 4)

In [304]:
df.dtypes

var_A    float64
var_B    float64
var_C    float64
var_D    float64
dtype: object

In [305]:
df.describe()

          var_A     var_B     var_C     var_D
count  6.000000  6.000000  6.000000  6.000000
mean   0.210227 -0.141789  0.740946 -0.241096
std    1.127452  1.131742  0.693915  1.075901
min   -1.066732 -1.796581 -0.024702 -1.374424
25%   -0.683580 -0.886090  0.148242 -1.197652
50%    0.087925  0.055533  0.770987 -0.281970
75%    1.198268  0.831454  1.258825  0.550539
max    1.524611  0.944649  1.566308  1.166624

In [306]:
df2

           A    B  C      D       F
0 2013-01-02  1.0  3   test  Python
1 2013-01-02  1.0  3  train  Python
2 2013-01-02  1.0  3   test  Python
3 2013-01-02  1.0  3  train  Python

In [307]:
df.shape

(6, 4)

In [308]:
df2.dtypes

A    datetime64[ns]
B           float32
C             int32
D          category
F            object
dtype: object

In [309]:
df2.describe()

         B    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [310]:
df

               var_A     var_B     var_C     var_D
2018-01-01 -1.066732  0.520149  1.566308  0.224808
2018-01-02  1.367745 -1.796581  1.248066 -0.788747
2018-01-03 -0.740111  0.944649 -0.024702  1.166624
2018-01-04  0.689837 -1.045093  0.099687  0.659116
2018-01-05 -0.513988  0.935222  1.262412 -1.374424
2018-01-06  1.524611 -0.409084  0.293908 -1.333953

In [311]:
df1 = df.reindex(index = datas [ 0: 4 ], columns = list(df.columns) + ['var_E'])

In [312]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01 -1.066732  0.520149  1.566308  0.224808    NaN
2018-01-02  1.367745 -1.796581  1.248066 -0.788747    NaN
2018-01-03 -0.740111  0.944649 -0.024702  1.166624    NaN
2018-01-04  0.689837 -1.045093  0.099687  0.659116    NaN

In [313]:
df1.loc[datas[0]: datas [1], 'var_E'] = 77

In [314]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01 -1.066732  0.520149  1.566308  0.224808   77.0
2018-01-02  1.367745 -1.796581  1.248066 -0.788747   77.0
2018-01-03 -0.740111  0.944649 -0.024702  1.166624    NaN
2018-01-04  0.689837 -1.045093  0.099687  0.659116    NaN

In [315]:
df1.describe()

          var_A     var_B     var_C     var_D  var_E
count  4.000000  4.000000  4.000000  4.000000    2.0
mean   0.062685 -0.344219  0.722340  0.315450   77.0
std    1.157089  1.292142  0.803002  0.830677    0.0
min   -1.066732 -1.796581 -0.024702 -0.788747   77.0
25%   -0.821766 -1.232965  0.068590 -0.028581   77.0
50%   -0.025137 -0.262472  0.673877  0.441962   77.0
75%    0.859314  0.626274  1.327626  0.785993   77.0
max    1.367745  0.944649  1.566308  1.166624   77.0

### 2.7.2. Dados faltantes NaN

In [316]:
datas = pd.date_range('20180101', periods = 60, freq="D")

df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE"))

In [317]:
df.head(3)

                   A         B         C         D         E
2018-01-01 -0.654168 -0.309652 -0.273603  0.875092  0.016525
2018-01-02 -0.481874 -0.621593  0.222529 -1.115039  0.707981
2018-01-03 -0.267020 -0.881275  1.465679 -0.286260  0.120808

In [318]:
df['F'] = df.A[df.A > 0]

In [319]:
df.head(3)

                   A         B         C         D         E   F
2018-01-01 -0.654168 -0.309652 -0.273603  0.875092  0.016525 NaN
2018-01-02 -0.481874 -0.621593  0.222529 -1.115039  0.707981 NaN
2018-01-03 -0.267020 -0.881275  1.465679 -0.286260  0.120808 NaN

In [320]:
df1 = df.copy()

In [321]:
df2 = df.copy()

**Extração dos valores NaN. Sempre que ultilizamos este comando, também perdemos os demais dados da linha.**

In [322]:
df1.dropna().shape

(26, 6)

In [323]:
df.shape

(60, 6)

In [324]:
df2.head()

                   A         B         C         D         E         F
2018-01-01 -0.654168 -0.309652 -0.273603  0.875092  0.016525       NaN
2018-01-02 -0.481874 -0.621593  0.222529 -1.115039  0.707981       NaN
2018-01-03 -0.267020 -0.881275  1.465679 -0.286260  0.120808       NaN
2018-01-04  0.319681 -0.391481  1.315878  0.549417  0.784087  0.319681
2018-01-05 -2.262988  0.470642 -0.476137  0.897366 -0.009013       NaN

**Substituição dos valores NaN pela média da coluna F**

In [325]:
df2.F.fillna(np.mean(df2.F))

2018-01-01    0.706365
2018-01-02    0.706365
2018-01-03    0.706365
2018-01-04    0.319681
2018-01-05    0.706365
2018-01-06    0.706365
2018-01-07    0.706365
2018-01-08    0.225591
2018-01-09    0.706365
2018-01-10    2.434624
2018-01-11    0.706365
2018-01-12    0.706365
2018-01-13    0.222382
2018-01-14    0.706365
2018-01-15    1.028701
2018-01-16    0.341193
2018-01-17    0.706365
2018-01-18    0.706365
2018-01-19    0.706365
2018-01-20    0.706365
2018-01-21    0.706365
2018-01-22    0.706365
2018-01-23    0.706365
2018-01-24    0.858166
2018-01-25    0.706365
2018-01-26    0.706365
2018-01-27    0.646722
2018-01-28    0.466837
2018-01-29    1.846664
2018-01-30    0.918048
2018-01-31    0.478440
2018-02-01    0.706365
2018-02-02    1.203912
2018-02-03    0.095262
2018-02-04    0.706365
2018-02-05    0.706365
2018-02-06    0.706365
2018-02-07    0.706365
2018-02-08    0.152589
2018-02-09    1.039839
2018-02-10    1.083531
2018-02-11    0.009406
2018-02-12    0.706365
2018-02-13    0.412053
2018-02-14    0.706365
2018-02-15    1.595038
2018-02-16    0.706365
2018-02-17    0.706365
2018-02-18    0.706365
2018-02-19    0.264955
2018-02-20    0.706365
2018-02-21    0.706365
2018-02-22    0.748759
2018-02-23    0.822987
2018-02-24    0.706365
2018-02-25    0.454718
2018-02-26    0.446176
2018-02-27    0.249223
2018-02-28    0.706365
2018-03-01    0.706365
Freq: D, Name: F, dtype: float64

In [326]:
df3 = df.copy()

**Substituição de TODOS os valores NaN da tabela por 777**

In [327]:
df3.fillna(value = 777)

                   A         B         C         D         E           F
2018-01-01 -0.654168 -0.309652 -0.273603  0.875092  0.016525  777.000000
2018-01-02 -0.481874 -0.621593  0.222529 -1.115039  0.707981  777.000000
2018-01-03 -0.267020 -0.881275  1.465679 -0.286260  0.120808  777.000000
2018-01-04  0.319681 -0.391481  1.315878  0.549417  0.784087    0.319681
2018-01-05 -2.262988  0.470642 -0.476137  0.897366 -0.009013  777.000000
2018-01-06 -1.032781  0.345392  0.145501  0.034347 -0.406285  777.000000
2018-01-07 -2.351212 -0.736602  0.225027  0.839227  1.453429  777.000000
2018-01-08  0.225591  0.730369 -0.633768 -0.989039  1.212694    0.225591
2018-01-09 -1.536912 -0.101722  0.511987 -0.757053  0.859589  777.000000
2018-01-10  2.434624 -0.047553  0.247911  0.666573  1.595213    2.434624
2018-01-11 -0.771024 -0.815115  0.448965  0.809814  0.959054  777.000000
2018-01-12 -0.198636  1.645647 -0.412002 -0.967870 -0.190514  777.000000
2018-01-13  0.222382 -0.157396 -0.228453 -0.182279  1.455363    0.222382
2018-01-14 -1.000099 -0.312010 -0.052634  0.768971 -0.673613  777.000000
2018-01-15  1.028701  0.464831 -1.004583 -1.304811 -0.194518    1.028701
2018-01-16  0.341193  0.706689 -1.262760  0.132469  1.666854    0.341193
2018-01-17 -0.691304  1.595394  0.939389 -0.721583  0.494411  777.000000
2018-01-18 -1.211211 -1.169636  0.941930 -0.547647 -0.406913  777.000000
2018-01-19 -0.462116  0.340920 -2.765089 -0.235047 -0.150916  777.000000
2018-01-20 -0.117101 -0.171972 -1.163685 -0.214855 -0.095028  777.000000
2018-01-21 -0.977322 -2.025066  1.208158 -0.783335  3.561379  777.000000
2018-01-22 -0.902193 -0.150797 -1.273229  0.780569 -0.302795  777.000000
2018-01-23 -0.187491 -1.481337 -1.509552  0.447742  0.655698  777.000000
2018-01-24  0.858166  0.390577 -0.484964  1.276252  0.180753    0.858166
2018-01-25 -0.057747  0.349367  1.622185 -0.322285  0.012223  777.000000
2018-01-26 -0.947469 -1.648788  0.048520  0.665299 -0.367170  777.000000
2018-01-27  0.646722  0.574849 -0.120046  0.938630 -0.620383    0.646722
2018-01-28  0.466837  0.327087 -1.085567 -0.066749  1.143209    0.466837
2018-01-29  1.846664 -1.469723 -0.935677 -0.268591 -0.201271    1.846664
2018-01-30  0.918048 -0.333929 -0.779129 -0.884331  0.898084    0.918048
2018-01-31  0.478440 -0.463070  0.358938 -0.765723 -0.428200    0.478440
2018-02-01 -1.162195 -0.562062 -0.190977  0.932488 -0.976753  777.000000
2018-02-02  1.203912  0.511769 -0.105001  0.519819  0.361239    1.203912
2018-02-03  0.095262  0.877769 -0.189101  0.108995  0.155730    0.095262
2018-02-04 -0.092293  0.364076 -0.700815  0.659846  0.931126  777.000000
2018-02-05 -0.212261 -0.627503  0.017108  0.901387  0.959630  777.000000
2018-02-06 -0.006326 -1.064396  0.366982  0.194963  0.102410  777.000000
2018-02-07 -0.804815 -0.563766  0.304609 -0.012320 -2.823359  777.000000
2018-02-08  0.152589 -0.513723  0.451043  0.710556 -0.640952    0.152589
2018-02-09  1.039839 -0.014448  1.712398  1.177330 -0.799132    1.039839
2018-02-10  1.083531  2.355896 -1.246669  1.360141  1.103300    1.083531
2018-02-11  0.009406  1.578299 -0.236008 -1.675771  1.357240    0.009406
2018-02-12 -0.229113  0.125181  1.363481  0.211727  0.294889  777.000000
2018-02-13  0.412053 -1.438267  0.539276 -1.158040 -0.586932    0.412053
2018-02-14 -0.768928  0.041366 -0.372377  1.621008 -0.156846  777.000000
2018-02-15  1.595038 -0.058841 -2.214809  0.833587  0.926062    1.595038
2018-02-16 -0.654484  0.420184 -0.933764 -0.398478 -0.073862  777.000000
2018-02-17 -0.109607 -0.417544 -0.672775  0.030527  0.385877  777.000000
2018-02-18 -0.430183  0.115473 -0.095961 -0.486916  0.108653  777.000000
2018-02-19  0.264955  0.291354 -0.135279 -0.926301  0.612978    0.264955
2018-02-20 -0.221295  1.758514 -0.163230 -0.306437 -0.226163  777.000000
2018-02-21 -2.144539 -0.257449  1.098726  0.181438 -1.418672  777.000000
2018-02-22  0.748759 -1.307392 -0.042986  1.489005 -0.075272    0.748759
2018-02-23  0.822987  0.066726  1.075591  1.331790  0.465235    0.822987
2018-02-24 -2.580806  2.166977  0.360556 -1.270080 -1.519281  777.000000
2018-02-25  0.454718  1.157074 -2.061158 -1.770846  0.347768    0.454718
2018-02-26  0.446176 -1.327838  1.213745 -1.057791 -0.264290    0.446176
2018-02-27  0.249223 -1.978167  2.249114 -0.559589  0.381185    0.249223
2018-02-28 -0.352077  0.283042  0.009425  0.625683  2.062531  777.000000
2018-03-01 -0.648812  0.712175 -0.900655  0.170698  0.117826  777.000000

### 2.7.3. Dados únicos

In [328]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python',
                    'G': [2, 2, 4, 4],http://localhost:8888/notebooks/Desktop/ad/analise_de_dados/notebooks/fundamentos_da_linguagem_python.ipynb#2.7.3.-Dados-%C3%BAnicos
                    'H': [np.nan, 2, 4, np.nan]
    
})

SyntaxError: invalid syntax (1595429303.py, line 7)

In [ ]:
df2

Sempre que usar a função nunique ela aponta os dados ÚNICOS ( axis=0 está relacionado a linha e axis= 1 à coluna)

In [ ]:
df2.nunique(axis = 1, dropna = True)

### 2.7.4. Dados duplicados

**Essa função mostra valores duplicados em todas as linhas**

In [ ]:
df2.drop_duplicates()

**Essa função mantém o 1° valor e exclui os valores duplicados na coluna especificada**

In [ ]:
df2.drop_duplicates(subset= 'G')

### 2.7.5. Ordenação dos dados

In [ ]:
df = pd.DataFrame({
                    'col1' : [ 'A', 'A', 'B', np.nan, 'D', 'C' ],  
                    'col2' : [ 2, 1, 9, 8, 7, 4 ],
                    'col3' : [ 0, 1, 9, 4, 2, 3 ],
                })

In [ ]:
df

**Ordenação de valores pela coluna 1**

In [ ]:
df.sort_values(by='col1')

**Ordenação de valores pelas colunas 1 e 2**

In [ ]:
df.sort_values(by=['col1', 'col2'])

**Ordenação de valores pelas colunas 1 e 2 de forma decrescente**

In [ ]:
df.sort_values(by=['col1', 'col2'], ascending= False)

In [ ]:
df.sort_values('col1', ascending= True)